Application/advancedlsc - Copy/backend/controllers/StudentController.php

SELECT * FROM `student` WHERE `id`='10'
---
    protected function findModel($id, $review_class_id, $schedule_id, $user_id)
    {
        if (($model = Student::findOne(['id' => $id, 'review_class_id' => $review_class_id, 'schedule_id' => $schedule_id, 'user_id' => $user_id])) !== null) {