Application/advancedlsc/backend/views/class-list/_form.php


    <?php $form = ActiveForm::begin(); ?>

     <?= $form->field($model, 'student_id')->dropDownList(
            ArrayHelper::map(Student::find()->all(),'id','id'),
            ['prompt'=>'Select Student ID']
     ) ?>

    <?= $form->field($model, 'review_Class_id')->dropDownList(
            ArrayHelper::map(ReviewClass::find()->all(),'review_Class_id','review_Class_name'),
            ['prompt'=>'Select Review Class']
    ) ?>

    <?= $form->field($model, 'employee_id')-> dropDownList(
            ArrayHelper::map(Employee::find()->all(),'employee_id','employee_name'),
            ['prompt'=>'Select Employee']
    ) ?>
---
SELECT * FROM `student`
SELECT * FROM `review_class`
SELECT * FROM `employee`